tap "felixkratz/formulae"
tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"
tap "opencode-ai/tap"
tap "sst/tap"
tap "th-ch/youtube-music"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Interactive environments for writing and running code
brew "jupyterlab", link: false
# Simple terminal UI for git commands
brew "lazygit"
# Multi-format archive and compression library
brew "libarchive"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@15", restart_service: :changed
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Terminal multiplexer
brew "tmux"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
cask "font-meslo-lg-nerd-font"
# Game development engine
cask "godot"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# YouTube Music Desktop App
cask "youtube-music"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-ssh"
vscode "be5invis.vscode-custom-css"
vscode "brandonkirbyson.vscode-animations"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "evondev.dracula-high-contrast"
vscode "illixion.vscode-vibrancy-continued"
vscode "katsute.code-background"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "shd101wyy.markdown-preview-enhanced"
